import 'package:herafy/features/auth/models/list_contry.dart';

final List<Country> governorates = [

  Country(
    title: "سوهاج",
    centers: [
      "سوهاج",
      "أخميم",
      "البلينا",
      "المراغة",
      "المنشأة",
      "دار السلام",
      "جرجا",
      "جهينة",
      "ساقلته",
      "طما",
      "طهطا",
    ],
  ),
  Country(
    title: "القاهرة",
    centers: [
      "مدينة نصر",
      "المعادي",
      "حلوان",
      "عين شمس",
      "الزيتون",
      "شبرا",
      "التجمع",
    ],
  ),
  Country(
    title: "الجيزة",
    centers: [
      "الدقي",
      "العجوزة",
      "الهرم",
      "فيصل",
      "6 أكتوبر",
      "الشيخ زايد",
    ],
  ),
  Country(
    title: "الإسكندرية",
    centers: [
      "سيدي جابر",
      "سموحة",
      "العجمي",
      "المنتزه",
      "محرم بك",
    ],
  ),
  Country(
    title: "الدقهلية",
    centers: [
      "المنصورة",
      "طلخا",
      "ميت غمر",
      "السنبلاوين",
      "دكرنس",
    ],
  ),
  Country(
    title: "البحر الأحمر",
    centers: [
      "الغردقة",
      "سفاجا",
      "القصير",
      "مرسى علم",
    ],
  ),
  Country(
    title: "البحيرة",
    centers: [
      "دمنهور",
      "كفر الدوار",
      "رشيد",
      "إدكو",
      "أبو المطامير",
    ],
  ),
  Country(
    title: "الفيوم",
    centers: [
      "الفيوم",
      "سنورس",
      "إطسا",
      "طامية",
      "يوسف الصديق",
    ],
  ),
  Country(
    title: "الغربية",
    centers: [
      "طنطا",
      "المحلة الكبرى",
      "زفتى",
      "كفر الزيات",
      "بسيون",
    ],
  ),
  Country(
    title: "الإسماعيلية",
    centers: [
      "الإسماعيلية",
      "فايد",
      "القنطرة شرق",
      "القنطرة غرب",
    ],
  ),
  Country(
    title: "المنوفية",
    centers: [
      "شبين الكوم",
      "السادات",
      "منوف",
      "أشمون",
      "قويسنا",
    ],
  ),
  Country(
    title: "المنيا",
    centers: [
      "المنيا",
      "ملوي",
      "بني مزار",
      "مطاي",
      "سمالوط",
    ],
  ),
  Country(
    title: "القليوبية",
    centers: [
      "بنها",
      "شبرا الخيمة",
      "القناطر الخيرية",
      "الخانكة",
      "طوخ",
    ],
  ),
  Country(
    title: "الوادي الجديد",
    centers: [
      "الخارجة",
      "الداخلة",
      "الفرافرة",
      "باريس",
    ],
  ),
  Country(
    title: "السويس",
    centers: [
      "السويس",
      "عتاقة",
      "الجناين",
    ],
  ),
  Country(
    title: "أسوان",
    centers: [
      "أسوان",
      "دراو",
      "كوم أمبو",
      "نصر النوبة",
      "إدفو",
    ],
  ),
  Country(
    title: "أسيوط",
    centers: [
      "أسيوط",
      "ديروط",
      "القوصية",
      "أبنوب",
      "منفلوط",
    ],
  ),
  Country(
    title: "بني سويف",
    centers: [
      "بني سويف",
      "الواسطى",
      "ناصر",
      "إهناسيا",
      "سمسطا",
    ],
  ),
  Country(
    title: "بورسعيد",
    centers: [
      "حي العرب",
      "حي الزهور",
      "حي الشرق",
      "حي المناخ",
    ],
  ),
  Country(
    title: "دمياط",
    centers: [
      "دمياط",
      "رأس البر",
      "فارسكور",
      "الزرقا",
    ],
  ),
  Country(
    title: "الشرقية",
    centers: [
      "الزقازيق",
      "بلبيس",
      "منيا القمح",
      "فاقوس",
      "العاشر من رمضان",
    ],
  ),
  Country(
    title: "جنوب سيناء",
    centers: [
      "شرم الشيخ",
      "دهب",
      "نويبع",
      "طابا",
    ],
  ),
  Country(
    title: "كفر الشيخ",
    centers: [
      "كفر الشيخ",
      "دسوق",
      "فوه",
      "مطوبس",
    ],
  ),
  Country(
    title: "مطروح",
    centers: [
      "مرسى مطروح",
      "الحمام",
      "الضبعة",
      "سيدي براني",
    ],
  ),
  Country(
    title: "الأقصر",
    centers: [
      "الأقصر",
      "الزينية",
      "البياضية",
      "القرنة",
      "أرمنت",
      "إسنا",
    ],
  ),
  Country(
    title: "قنا",
    centers: [
      "قنا",
      "نجع حمادي",
      "دشنا",
      "قفط",
      "قوص",
    ],
  ),
  Country(
    title: "شمال سيناء",
    centers: [
      "العريش",
      "الشيخ زويد",
      "رفح",
    ],
  ),
];
